app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]
---
  def check
    user = User.find_by_username(params[:user][:username])

INSERT INTO "users" ("username", "password", "email") VALUES (?, ?, ?)  [["username", "asdfgh"], ["password", "admin"], ["email", "vccbcv"]]
---
  def create
    @user = User.create(username: params[:user][:username],password: params[:user][:password],email: params[:user][:email])